# Database Name : RSQL
# Table Name : score
- id, korean, english, mathematics integer

- Anaconda Navigator
- rJava, RMySQL 설치하기

In [1]:
library(RMySQL)

Loading required package: DBI

In [2]:
# DB Connection

conn <- dbConnect(MySQL(),
                  dbname = 'RSQL',
                  user = 'root',
                  password = 'qwer1234',
                  host = '127.0.0.1' 
                 )

In [3]:
# 테이블 목록
dbListTables(conn)

[1] "score"

In [4]:
# 테이블의 컬럼 목록
dbListFields(conn, 'score')

[1] "id"          "korean"      "english"     "mathematics"

In [5]:
# 쿼리작성 (select)
dbGetQuery(conn, 'select count(*) from score')

  count(*)
1 0

In [6]:
dbGetQuery(conn, 'select * from score')

     id korean english mathematics

In [7]:
# insert 쿼리작성
dbSendQuery(conn, 'insert into score values(1, 100, 100, 100)')

result <- dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100

In [8]:
dbSendQuery(conn, 'insert into score values(2, 90, 90, 90)')

result <- dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     90      90

In [9]:
# Update

dbSendQuery(conn, 'update score set korean = 90, english = 80, mathematics = 70
                    where id=2')

result <- dbGetQuery(conn, 'select * from score')
result

  id korean english mathematics
1 1  100    100     100
2 2   90     80      70

In [11]:
# delete

dbSendQuery(conn, 'delete from score')

result <- dbGetQuery(conn, 'select * from score')
result

     id korean english mathematics

In [12]:
# csv file을 읽어서 MySQL에 넣기
data <- read.csv("../Data/score.csv", header = F)
colnames(data) <- c('id','korean','english','mathematics')
data

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [13]:
dbWriteTable(conn, 'score', data, overwrite=T, row.names=F)
# overwrite =F 기존데이터 삭제, append =T 기존데이터 포함

[1] TRUE

In [14]:
result = dbGetQuery(conn, "select * from score")
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [15]:
str(result)

'data.frame':	10 obs. of  4 variables:
 $ id         : num  1 2 3 4 5 6 7 8 9 10
 $ korean     : num  90 90 90 90 90 100 100 100 100 100
 $ english    : num  80 88 89 87 60 100 100 100 100 100
 $ mathematics: num  70 70 70 70 70 100 100 100 100 100

In [20]:
data2 <- read.csv("../Data/score2.csv", header = F)

colnames(data2) <- c('id','korean','english','mathematics')
data2

  V1 V2 V3 V4
1 11 90 80 70
2 12 90 88 70

  id korean english mathematics
1 11 90     80      70
2 12 90     88      70

In [21]:
dbWriteTable(conn, 'score', data2, append=T, row.names=Fm overwrite=F)

[1] TRUE

In [23]:
result <- dbGetQuery(conn, 'select * from score')
result

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100
11 11  90     80      70
12 12  90     88      70

In [26]:
# Disconnect == conn.close()
dbDisconnect(conn)

ERROR: Error in .local(dbObj, ...): internal error in RS_DBI_getConnection: corrupt connection handle